benoit-bremaud/esp32-ocpp-client/src/infrastructure/security/ESP32CertificateManager.cpp
#include "ESP32CertificateManager.h"
#include <Arduino.h>
#include <ArduinoJson.h>
#include <mbedtls/x509.h>
#include <mbedtls/pk.h>
#include <mbedtls/oid.h>

using namespace Infrastructure;

ESP32CertificateManager::ESP32CertificateManager() {
    // Initialize mbedTLS contexts
    mbedtls_ctr_drbg_init(&ctr_drbg);
    mbedtls_entropy_init(&entropy);
}

ESP32CertificateManager::~ESP32CertificateManager() {
    cleanup();
}

bool ESP32CertificateManager::initialize() {
    if (initialized) {
        return true;
    }
    
    Serial.println("Initializing ESP32 Certificate Manager...");
    
    // Initialize LittleFS if not already done
    if (!LittleFS.begin()) {
        Serial.println("Failed to initialize LittleFS");
        setLastError(CertificateManagerError::FILESYSTEM_ERROR);
        return false;
    }
    fileSystemReady = true;
    
    // Initialize mbedTLS
    if (!initializeMbedTLS()) {
        Serial.println("Failed to initialize mbedTLS");
        return false;
    }
    
    // Create certificate directory if it doesn't exist
    if (!ensureDirectoryExists(CERT_BASE_PATH)) {
        Serial.println("Failed to create certificate directory");
        setLastError(CertificateManagerError::FILESYSTEM_ERROR);
        return false;
    }
    
    // Load existing certificate metadata
    updateCertificateMetadata();
    
    initialized = true;
    Serial.println("Certificate Manager initialized successfully");
    
    return true;
}

void ESP32CertificateManager::cleanup() {
    cleanupMbedTLS();
    
    if (fileSystemReady) {
        // LittleFS.end(); // Uncomment if you want to fully unmount
    }
    
    initialized = false;
    fileSystemReady = false;
}

bool ESP32CertificateManager::initializeMbedTLS() {
    const char* personalization = "esp32_ocpp_cert_manager";
    
    int ret = mbedtls_ctr_drbg_seed(&ctr_drbg, mbedtls_entropy_func, &entropy,
                                   (const unsigned char*)personalization,
                                   strlen(personalization));
    if (ret != 0) {
        Serial.printf("mbedTLS initialization failed: %s\n", formatMbedTLSError(ret).c_str());
        return false;
    }
    
    return true;
}

void ESP32CertificateManager::cleanupMbedTLS() {
    mbedtls_ctr_drbg_free(&ctr_drbg);
    mbedtls_entropy_free(&entropy);
}

std::string ESP32CertificateManager::formatMbedTLSError(int error) {
    char error_buf[256];
    mbedtls_strerror(error, error_buf, sizeof(error_buf));
    return std::string(error_buf);
}

std::string ESP32CertificateManager::getCertificatePath(CertificateType type) const {
    switch (type) {
        case CertificateType::CentralSystemRootCert:
            return CA_CERT_PATH;
        case CertificateType::ChargePointCert:
            return CLIENT_CERT_PATH;
        case CertificateType::ManufacturerRootCert:
            return MANUFACTURER_CA_PATH;
        case CertificateType::V2GRootCert:
            return V2G_CA_PATH;
        case CertificateType::V2GCert:
            return V2G_CERT_PATH;
        default:
            return "";
    }
}

std::string ESP32CertificateManager::getPrivateKeyPath(CertificateType type) const {
    switch (type) {
        case CertificateType::ChargePointCert:
            return CLIENT_KEY_PATH;
        case CertificateType::V2GCert:
            return V2G_KEY_PATH;
        default:
            return ""; // CA certificates don't have private keys stored
    }
}

std::string ESP32CertificateManager::getCertificateTypeString(CertificateType type) const {
    switch (type) {
        case CertificateType::CentralSystemRootCert:
            return "Central System Root CA";
        case CertificateType::ChargePointCert:
            return "Charge Point Certificate";
        case CertificateType::ManufacturerRootCert:
            return "Manufacturer Root CA";
        case CertificateType::V2GRootCert:
            return "V2G Root CA";
        case CertificateType::V2GCert:
            return "V2G Certificate";
        default:
            return "Unknown";
    }
}

bool ESP32CertificateManager::ensureDirectoryExists(const std::string& path) {
    if (!fileSystemReady) {
        return false;
    }
    
    // LittleFS doesn't have explicit directory creation, but we can check if we can write to the path
    File testFile = LittleFS.open((path + "/.test").c_str(), "w");
    if (!testFile) {
        return false;
    }
    testFile.close();
    LittleFS.remove((path + "/.test").c_str());
    
    return true;
}

bool ESP32CertificateManager::validateFileSystemSpace(size_t requiredBytes) {
    if (!fileSystemReady) {
        return false;
    }
    
    size_t totalBytes = LittleFS.totalBytes();
    size_t usedBytes = LittleFS.usedBytes();
    size_t availableBytes = totalBytes - usedBytes;
    
    return availableBytes >= requiredBytes;
}

bool ESP32CertificateManager::writeSecureFile(const std::string& path, const std::string& content) {
    if (!fileSystemReady) {
        setLastError(CertificateManagerError::FILESYSTEM_ERROR);
        return false;
    }
    
    // Check available space
    if (!validateFileSystemSpace(content.length() + 1024)) { // Add some buffer
        setLastError(CertificateManagerError::STORAGE_FULL);
        return false;
    }
    
    File file = LittleFS.open(path.c_str(), "w");
    if (!file) {
        Serial.printf("Failed to open file for writing: %s\n", path.c_str());
        setLastError(CertificateManagerError::FILESYSTEM_ERROR);
        return false;
    }
    
    size_t bytesWritten = file.write((const uint8_t*)content.c_str(), content.length());
    file.close();
    
    if (bytesWritten != content.length()) {
        Serial.printf("Failed to write complete content to file: %s\n", path.c_str());
        setLastError(CertificateManagerError::FILESYSTEM_ERROR);
        return false;
    }
    
    Serial.printf("Successfully wrote %d bytes to %s\n", bytesWritten, path.c_str());
    return true;
}

std::string ESP32CertificateManager::readSecureFile(const std::string& path) {
    if (!fileSystemReady) {
        setLastError(CertificateManagerError::FILESYSTEM_ERROR);
        return "";
    }
    
